{
  "home": {   
    "iAm": "I'm a front-end developer",
    "salutation": "Hi!",
    "myName": " My name is",
    "aboutMe": "About me",
    "projects": "Projects",
    "contact": "Contact"
  },
  "about": {
    "aboutMe": "I'm a front-end developer currently working at [Citifyd]. I'm currently studying Analysis and Systems Development at the Estácio de Sá university. I like to solve problems, and I'm always willing to learn new tools and technologies to solve them in a better way.",
    "citifydProjects": "One of the main projects I've been working on is the refactor of Citifyd's parking provider Dashboard from Angular.js to React. In these projects we refactored the entire system, implemented Storybook with the creation of reusable components, in addition to the creation of unit tests. I've also worked on the development of the institutional website at the company, using Next.JS, CSS modules, TypeScript and Storybook.",
    "contact": "If you are interested in getting to know my work or just exchange ideas, do not hesitate to [get in touch]!",
    "technologies": "Technologies",
    "responsive": "Responsive"
  },
  "projects": {
    "twitterClone": {
      "title": "Twitter Clone",
      "description": "Twitter clone, developed to practice full-stack development. It has image upload features, password recovery, user name and email validation, ability to follow users, timeline, mentions, and hashtags. The front-end uses React.js,  Bootstrap, HTML and Sass. On the back-end, Node.js with Express, and MySQL."
    },
    "santaVeiculos": "Website developed for a car dealership in Santa Cruz do Sul. As a freelancer, I worked for GHS Web in the development of responsive layout using HTML, CSS and JavaScript.",
    "tenisClub": "Portal developed with Wordpress for a club in Santa Cruz do Sul, I worked on development of a custom theme using Bootstrap and jQuery, and also in the development of page types and custom post types.",
    "pcVeiculos": "Website developed for a car dealership in Santa Cruz do Sul. In this project, knowledge in HTML, CSS and JavaScript was applied, as well as connection to the database using PHP and MySQL.",
    "numa": "Website developed with GHS Web. I worked on the frontend applying knowledge in HTML, CSS and JavaScript, with responsive layout.",
    "jogoDaVelha": { 
      "title": "Tic-tac-toe",
      "description": "Tic-tac-toe game developed in React.js, HTML and Sass with Bootstrap, to improve knowledge in logic, grid and responsive. It has winner verification, and sum of points and ties."
    },
    "visitWebsite": "Visit website",
    "seeOnGithub": "See on GitHub"
  },
  "contact": "You can use the channels below to get in touch:",
  "languages": {
    "languages": "languages",
    "language": "Language",
    "english":   "English",
    "portuguese": "Portuguese",
    "fluent": "Fluent",
    "intermediate": "Intermediate"
  }
}
