{
  "home": {
    "iAm": "Sou desenvolvedora front-end",
    "salutation": "Olá!",
    "myName": "Meu nome é",
    "aboutMe": "Sobre mim",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "about": {
    "aboutMe": "Tenho 24 anos, sou desenvolvedora front-end júnior, atualmente trabalhando na [Citifyd]. Curso Análise e Desenvolvimento de Sistemas na Universidade Estácio de Sá e possuo inglês intermediário. Sou uma pessoa disposta a aprender novas tecnologias e procuro sempre aprimorar meus conhecimentos. Hoje na Citifyd trabalho com o desenvolvendo de novas funcionalidades dentro do sistema utilizando React.",
    "citifydProjects": "Um dos principais  projetos que tenho trabalhado é a migração do Dashboard da Citifyd de AngularJS para React. Nesse projetos migramos todo o sistema, implementamos o Storybook com a criação de componentes reutilizáveis, além da criação testes unitários. Também trabalhei no desenvolvimento no site institucional na empresa, utilizando nextJS, css modules, typescript e storybook.",
    "contact": "Caso tenha interesse em conhecer meus trabalhos ou trocar alguma ideia, não deixe de [entrar em contato comigo] ou conheça mais sobre os [meus projetos]!",
    "languages": "idiomas",
    "technologies": "Tecnologias",
    "responsive": "Responsivo"
  },
  "projects": {
    "twitterClone": {
      "title": "Clone do Twitter",
      "description": "Clone do Twitter, desenvolvido para aprimorar conhecimentos em Frontend e Backend. Possui funcionalidades de upload de imagens, recuperação de senha, validação de nome e email de usuários, seguir usuários, timeline, menções, hashtags e horário de publicação. No frontend foi utilizada a biblioteca React.js, o framework Bootstrap, HTML e Sass. No backend, node.js e MySQL."
    },
    "santaVeiculos": "Web site desenvolvido para revenda de veículos de Santa Cruz do Sul. Como freelancer, trabalhei com a GHS Web no desenvolvimento do layout responsivo utilizando HTML, CSS e JavaScript.",
    "tenisClub":"Portal desenvolvido com Wordpress para clube em Santa Cruz do Sul, auxiliei no desenvolvimento do tema personalizado utilizando Bootstrap e jQuery, e também no desenvolvimento de tipos de páginas e tipos de posts customizados.",
    "pcVeiculos": "Web site desenvolvido para uma revenda de veículos de Santa Cruz do Sul em parceria com a GHS Web. Nesse projeto foram aplicados conhecimentos em HTML, CSS e JavaScript, além de conexão com o banco de dados utilizando PHP e MySQL.",
    "numa": "Web site desenvolvido em parceria com a GHS Web. Trabalhei no frontend aplicando conhecimentos em HTML, CSS e JavaScript, com layout responsivo.",
    "jogoDaVelha": { 
      "title": "Jogo da Velha",
      "description": "Jogo da velha, desenvolvido em React.js, HTML e Sass, para aprimorar conhecimentos em lógica, grid e responsivo. Foi utilizado o framework Bootstrap. Possui verificação de ganhador, e somatória de pontos e empates."
    },
    "visitWebsite": "Ver site",
    "seeOnGithub": "Ver no GitHub"
  },
  "contact": "Você pode usar os canais abaixo para entrar em contato:",
  "languages": {
    "languages": "Idiomas",
    "language": "Idioma",
    "english":   "Inglês",
    "portuguese": "Português",
    "fluent": "Fluente",
    "intermediate": "Intermediário"
  }
}
