{
  "home": {
    "iAm": "Sou desenvolvedora front-end",
    "salutation": "Olá!",
    "myName": "Meu nome é",
    "aboutMe": "Sobre mim",
    "experience": "Experiência",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "about": {
    "aboutMe": "Sou desenvolvedora front-end, atualmente trabalhando na [Citifyd]. Curso Análise e Desenvolvimento de Sistemas na Universidade Estácio de Sá e possuo inglês intermediário. Sou uma pessoa disposta a aprender novas tecnologias e procuro sempre aprimorar meus conhecimentos. Hoje na Citifyd trabalho com o desenvolvendo de novas funcionalidades dentro do sistema utilizando React.",
    "citifydProjects": "Um dos principais  projetos que tenho trabalhado é a migração do Dashboard da Citifyd de AngularJS para React. Nesse projetos migramos todo o sistema, implementamos o Storybook com a criação de componentes reutilizáveis, além da criação testes unitários. Também trabalhei no desenvolvimento no site institucional na empresa, utilizando nextJS, css modules, typescript e storybook.",
    "contact": "Caso tenha interesse em conhecer meus trabalhos ou trocar alguma ideia, não deixe de [entrar em contato comigo] ou conheça mais sobre os [meus projetos]!",
    "languages": "idiomas",
    "technologies": "Tecnologias",
    "responsive": "Responsivo"
  },
  "experience": {
     "events": {
      "description": "A Events.com é uma plataforma global de gestão de eventos que permite aos organizadores planejar, promover, vender e executar eventos presenciais, virtuais e híbridos usando um conjunto de ferramentas modernas e integradas. A plataforma oferece suporte a tudo, desde venda de ingressos e patrocínios até marketing, insights de dados e execução no local, ajudando os criadores a proporcionar experiências excepcionais em eventos. Na Events.com, trabalho como Engenheiro Front-End, contribuindo para o desenvolvimento e a manutenção de aplicações web escaláveis ​​e focadas no usuário, utilizando React e TypeScript. Minhas principais responsabilidades e conquistas incluem: Colaborar com equipes multifuncionais para construir e manter aplicações modernas, responsivas e acessíveis que suportam todo o ciclo de vida do evento. Implementar componentes de UI reutilizáveis ​​e padrões de design, garantindo consistência em toda a plataforma e contribuindo para a evolução do sistema de design da empresa. Otimizar o desempenho e o SEO, aplicando as melhores práticas para melhorar a velocidade de carregamento, a acessibilidade, os Core Web Vitals e a visibilidade geral. Apoiar o desenvolvimento de novos recursos em diversas áreas de produto, incluindo descoberta de eventos, fluxos de venda de ingressos e ferramentas para organizadores.",
      "period": "Jan 2024 – Atual"
    },
    "citifyd": {
      "description": "A Citifyd conecta motoristas a estacionamentos e empresas locais, reduzindo custos, aumentando a receita e dinamizando o comércio local ao simplificar a mobilidade urbana. A plataforma facilita a busca e a compra de vagas de estacionamento para os motoristas, a oferta de vagas disponíveis para os estacionamentos e a atração de clientes para as empresas locais. Na Citifyd, trabalhei na manutenção e no desenvolvimento de novos recursos utilizando tecnologias front-end como React e Next.js. Minhas contribuições incluíram a migração incremental do Painel de Controle do Estacionamento do legado AngularJS para React, garantindo a manutenção a longo prazo e mantendo o sistema totalmente operacional; a implementação de uma biblioteca de componentes reutilizáveis ​​em TypeScript utilizando Storybook com testes unitários; o desenvolvimento de um website focado em B2B com forte ênfase em SEO utilizando Next.js, CSS Modules e práticas modernas de front-end; e a criação de recursos para o painel de controle, como precificação dinâmica baseada em eventos, permitindo ajustes automáticos de preços com base no volume de transações e no tempo restante até os eventos.",
      "period": "Agosto 2021 – Abril 2024"
    },
    "suitable": {
      "description": "Suitable é um sistema de gestão para restaurantes. Seu produto principal é um aplicativo web personalizado para cada estabelecimento, permitindo que eles ofereçam uma experiência de pedido eficiente aos clientes enquanto evitam as taxas de plataformas como o iFood. O sistema também inclui um bot próprio para WhatsApp (a plataforma de mensagens mais popular do Brasil) que direciona o usuário para o app do restaurante e envia atualizações automáticas sobre o status do pedido. Durante meu período na empresa, não houve desenvolvimento de novas funcionalidades, na correção de bugs e na refatoração do código do painel de controle do restaurante, desenvolvido em React. Também participei da reescrita completa do site, migrando de PHP para Next.js.",
      "period": "Dezembro 2020 – Julho 2021"
    }
  },
  "projects": {
    "twitterClone": {
      "title": "Clone do Twitter",
      "description": "Clone do Twitter, desenvolvido para aprimorar conhecimentos em Frontend e Backend. Possui funcionalidades de upload de imagens, recuperação de senha, validação de nome e email de usuários, seguir usuários, timeline, menções, hashtags e horário de publicação. No frontend foi utilizada a biblioteca React.js, o framework Bootstrap, HTML e Sass. No backend, node.js e MySQL."
    },

    "santaVeiculos": "Web site desenvolvido para revenda de veículos de Santa Cruz do Sul. Como freelancer, trabalhei com a GHS Web no desenvolvimento do layout responsivo utilizando HTML, CSS e JavaScript.",
    "tenisClub":"Portal desenvolvido com Wordpress para clube em Santa Cruz do Sul, auxiliei no desenvolvimento do tema personalizado utilizando Bootstrap e jQuery, e também no desenvolvimento de tipos de páginas e tipos de posts customizados.",
    "pcVeiculos": "Web site desenvolvido para uma revenda de veículos de Santa Cruz do Sul em parceria com a GHS Web. Nesse projeto foram aplicados conhecimentos em HTML, CSS e JavaScript, além de conexão com o banco de dados utilizando PHP e MySQL.",
    "visitWebsite": "Ver site",
    "seeOnGithub": "Ver no GitHub"
  },
  "contact": "Você pode usar os canais abaixo para entrar em contato:",
  "languages": {
    "languages": "Idiomas",
    "language": "Idioma",
    "english":   "Inglês",
    "portuguese": "Português",
    "fluent": "Fluente",
    "advanced": "Avançado"
  }
}
